
| commands | action                          |
|----------+---------------------------------|
| C-c /    | Search and create sparse trees. |
|          |                                 |
   

* Blocks
  Org mode uses begin/end blocks for various purposes from including source code examples
  to capturing time logging information.

  You can start a code block like this:
    #+BEGIN_SRC sh
    echo "Hello world!"
    #+END_SRC
  and when you export it, it will have a nice HTML-box around it.
  
  If you have BABEl installed, it can be evaluated.

 | Commands | Actions                                   |
 | C-c C-c  | Evaluate inside code block(requires babel |
 |----------+-------------------------------------------|
 
 with babel :
 
    #+BEGIN_SRC sh :exports both
    echo "Hello world!"
    #+END_SRC
 
    #+results:
    : Hello world

 Note, you need ":exports both" to export both the SRC and the *results*.
 
 You also have "easy templates" in babel.

| s | #+BEGIN_SRC ... #+END_SRC         |
| e | #+BEGIN_EXAMPLE ... #+END_EXAMPLE |
| q | #+BEGIN_QUOTE ... #+END_QUOTE     |
| v | #+BEGIN_VERSE ... #+END_VERSE     |
| c | #+BEGIN_CENTER ... #+END_CENTER   |
| l | #+BEGIN_LaTeX ... #+END_LaTeX     |
| L | #+LaTeX:                          |
| h | #+BEGIN_HTML ... #+END_HTML       |
| H | #+HTML:                           |
| a | #+BEGIN_ASCII ... #+END_ASCII     |
| A | #+ASCII:                          |
| i | #+INDEX: line                     |
| I | #+INCLUDE: line                   |

